In [110]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

In [111]:
data = pd.read_csv(r"C:\Users\Chet\Documents\Messy data set.csv")

In [112]:
data.head(10)

     ID     Name         Age               Email    JoinDate    Salary
0     1    Alice          25   alice@example.com  2020-01-01     50000
1     2      Bob          30     bob@example.com  not a date     60000
2     2      Bob          30     bob@example.com  2020-02-01     60000
3     4  Charlie         NaN            charlie@  2020-03-01     70000
4     5    David  Twenty-two                 NaN  2020-04-01       NaN
5     6      Eve          45         eve@example  2020-05-01     90000
6     7    Frank          50  frank@@example.com  2020-06-01    100000
7     8    Grace          55   grace@example.com  2020-07-01  one lakh
8  nine    Heidi          60   heidi@example.com  2020.08.01    120000
9    10      NaN          65      10@example.com  2020-09-01    130000

#### Value counts

In [114]:
data['Age'].value_counts()

Age
30            2
25            1
Twenty-two    1
45            1
50            1
55            1
60            1
65            1
Name: count, dtype: int64

## Descriptive

In [116]:
data.describe()

        ID Name Age            Email    JoinDate Salary
count   10    9   9                9          10      9
unique   9    8   8                8          10      8
top      2  Bob  30  bob@example.com  2020-01-01  60000
freq     2    2   2                2           1      2

## Group by

In [118]:
data = pd.DataFrame({
    'Name': ['Alice','Bob','Charlie'],
    'Salary': [50000,60000,70000]
})

In [119]:
grouped_var = data.groupby('Name')['Salary'].mean()
print(grouped_var)

Name
Alice      50000.0
Bob        60000.0
Charlie    70000.0
Name: Salary, dtype: float64

## pivot table

In [120]:

data = pd.DataFrame({
    'ID' : [1,2,3,4,5],
    'Age' : [25,35,40,35,42],
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Eve']
})


pivot_table = data.pivot_table(
    index='Name',
    values=['ID', 'Age'],
    aggfunc={'ID': 'mean', 'Age': 'mean'}
)

print(pivot_table)

          Age   ID
Name
Alice    25.0  1.0
Bob      35.0  2.0
Charlie  40.0  3.0
David    35.0  4.0
Eve      42.0  5.0

## cross tab

In [133]:

data = pd.DataFrame({
    'DATA': ['1', '1', '2', '2', '3', '1', '3'],
    'DATA1': ['A', 'B', 'A', 'B', 'A', 'A', 'A']
})


cross_tab = pd.crosstab(data['DATA'],data['DATA1'],
    margins=True,                
    normalize='index')           


print(cross_tab)

DATA1         A         B
DATA
1      0.666667  0.333333
2      0.500000  0.500000
3      1.000000  0.000000
All    0.714286  0.285714